zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_sha_v2.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Start
****************************************************************************//**
*
* Initializes the initial hash vector.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Start(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *hashRemap;
    uint8_t *initialHashRemap;

    if (hashState != NULL)
    {
        hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);
        initialHashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->initialHash);

        hashState->blockIdx = 0U;
        hashState->messageSize = 0U;

        #if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
        switch ((cy_en_crypto_sha_mode_t)hashState->mode)
        {
            case CY_CRYPTO_MODE_SHA3_224:
            case CY_CRYPTO_MODE_SHA3_256:
            case CY_CRYPTO_MODE_SHA3_384:
            case CY_CRYPTO_MODE_SHA3_512:
                        Cy_Crypto_Core_V2_MemSet(base, hashRemap, (uint8_t) 0, (uint16_t) CY_CRYPTO_SHA3_STATE_SIZE);
                        tmpResult = CY_CRYPTO_SUCCESS;
                        break;
            default:
                    tmpResult = CY_CRYPTO_BAD_PARAMS;
                    break;
        }
        #endif

        if (hashState->hashSize != 0U)
        {
            Cy_Crypto_Core_V2_MemCpy(base, (void*)hashRemap, (void *)initialHashRemap, (uint16_t)hashState->hashSize);
            tmpResult = CY_CRYPTO_SUCCESS;
        }

    }

    return (tmpResult);
}

#if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)

/*******************************************************************************
* Function Name: Cy_Crypto_Sha3_Update
****************************************************************************//**
*
* Performs the SHA3 update calculation on message.
*
* For CAT1C & CAT1D(CM55) devices when D-Cache is enabled parameter message must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param message
* The pointer to the message whose Hash is being computed.
*
* \param messageSize
* The size of the message whose Hash is being computed.
*
* \return
* \ref cy_en_crypto_status_t
*
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Sha3_Update(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState,
                               uint8_t const *message,
                               uint32_t messageSize)
{

    uint32_t hashBlockIdx  = hashState->blockIdx;
    uint32_t hashBlockSize = hashState->blockSize;

    uint8_t *hashRemap;
    uint8_t *messageRemap;

    hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);
    messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(message);

    /* Load the calculated hash from the context buffer */
    Cy_Crypto_Core_V2_RBClear(base);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashRemap, CY_CRYPTO_SHA3_STATE_SIZE);
    Cy_Crypto_Core_V2_RBXor(base, 0U, 128U);
    Cy_Crypto_Core_V2_RBSwap(base);
    Cy_Crypto_Core_V2_RBXor(base, 0U, 72U);
    Cy_Crypto_Core_V2_RBSwap(base);

    /* Start the message loading */
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, messageRemap, messageSize);

    /* Processing the fully filled blocks with remaining buffer data */
    while ((hashBlockIdx + messageSize) >= hashBlockSize)
    {
        uint32_t tempBlockSize = hashBlockSize - hashBlockIdx;

        if(hashBlockSize>128U) // This condition is for the SHA3_224 & SHA3_256 where the rate size is more that 1024 bits
        {
            if(hashBlockIdx<=128U)
            {
                Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, 128U-hashBlockIdx);
                Cy_Crypto_Core_V2_RBSwap(base);
                Cy_Crypto_Core_V2_RBXor(base, 0U, hashBlockSize-128U);
                Cy_Crypto_Core_V2_RBSwap(base);
            }
            else
            {
                Cy_Crypto_Core_V2_RBSwap(base);
                Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx - 128U, hashBlockSize-hashBlockIdx);
                Cy_Crypto_Core_V2_RBSwap(base);
            }
        }
        else
        {
            Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, tempBlockSize);
        }

        Cy_Crypto_Core_V2_Run(base, hashState->modeHw);

        messageSize -= tempBlockSize;
        hashBlockIdx = 0U;
    }

    hashState->blockIdx = hashBlockIdx + messageSize;

    /* Load the end of the message (tail that less then block size) to the register buffer */
    if (messageSize != 0U)
    {
        if(hashBlockSize>128U)
        {
            if(messageSize + hashBlockIdx <= 128U)
            {
                Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, messageSize);
                Cy_Crypto_Core_V2_Sync(base);
            }

            else
            {
                if(hashBlockIdx<128U)
                {
                    Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, 128U-hashBlockIdx);
                    Cy_Crypto_Core_V2_RBSwap(base);
                    Cy_Crypto_Core_V2_RBXor(base, 0U, messageSize - 128U);
                    Cy_Crypto_Core_V2_RBSwap(base);
                }
                else
                {
                    Cy_Crypto_Core_V2_RBSwap(base);
                    Cy_Crypto_Core_V2_RBXor(base,  hashBlockIdx % 128U , messageSize);
                    Cy_Crypto_Core_V2_RBSwap(base);
                }
            }
        }
        else
        {
            Cy_Crypto_Core_V2_RBXor(base, hashBlockIdx, messageSize);
            Cy_Crypto_Core_V2_Sync(base);
        }
    }

    /* Store the hash state to the context buffer */
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, hashRemap, 128);
    Cy_Crypto_Core_V2_RBStore(base, 0U, 128U);
    Cy_Crypto_Core_V2_FFStoreSync(base);

    Cy_Crypto_Core_V2_RBSwap(base);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, &hashRemap[128u], 72u);
    Cy_Crypto_Core_V2_RBStore(base, 0U, 72U);
    Cy_Crypto_Core_V2_FFStoreSync(base);

