zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_sha_v2.c
    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Sha1_Sha2_Finish
****************************************************************************//**
*
* Completes SHA1/SHA2 calculation.
*
* For CAT1C & CAT1D(CM55) devices when D-Cache is enabled parameter digest must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param digest
* The pointer to the calculated hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Sha1_Sha2_Finish(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t *digest)
{
    uint32_t hashBlockSize   = hashState->blockSize;
    uint32_t hashBlockIdx    = hashState->blockIdx;

    uint64_t finalMessageSizeInBits = hashState->messageSize * 8U;
    uint32_t padSize;
    uint8_t *hashRemap;
    uint8_t *blockRemap;

    hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);
    blockRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->block);
    
    if (CY_CRYPTO_SHA512_BLOCK_SIZE == hashBlockSize)
    {
        padSize = CY_CRYPTO_SHA512_PAD_SIZE; /* Pad size = 112 */
    }
    else
    {
        padSize = CY_CRYPTO_SHA256_PAD_SIZE; /* Pad size = 56 */
    }

    /* Load the calculated hash from the context buffer */
    Cy_Crypto_Core_V2_RBClear(base);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, hashRemap, hashState->hashSize);
    Cy_Crypto_Core_V2_RBXor(base, 0U, hashState->hashSize);
    Cy_Crypto_Core_V2_Sync(base);
    Cy_Crypto_Core_V2_RBSwap(base);

    /* Load the end of the message (tail that less then block size) to the register buffer */
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_LOAD0, blockRemap, hashBlockIdx);
    Cy_Crypto_Core_V2_RBXor(base, 0U, hashBlockIdx);

    /* Sync until XOR operation is completed */
    Cy_Crypto_Core_V2_Sync(base);

    /* Append 1 bit to the end of the message */
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockIdx, 0x80U);

    if (hashBlockIdx >= padSize)
    {
        Cy_Crypto_Core_V2_Run(base, hashState->modeHw);
        Cy_Crypto_Core_V2_Sync(base);
    }

    /* Append message size into last of the block */

    /* In case of u64SizeInByte * 8 > u64Max */

    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 8U, (uint8_t)(finalMessageSizeInBits >> 56U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 7U, (uint8_t)(finalMessageSizeInBits >> 48U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 6U, (uint8_t)(finalMessageSizeInBits >> 40U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 5U, (uint8_t)(finalMessageSizeInBits >> 32U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 4U, (uint8_t)(finalMessageSizeInBits >> 24U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 3U, (uint8_t)(finalMessageSizeInBits >> 16U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 2U, (uint8_t)(finalMessageSizeInBits >> 8U));
    Cy_Crypto_Core_V2_RBSetByte(base, hashBlockSize - 1U, (uint8_t)(finalMessageSizeInBits));

    Cy_Crypto_Core_V2_Run(base, hashState->modeHw);
    Cy_Crypto_Core_V2_Sync(base);

    /* Write digest. */
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, digest, hashState->digestSize);
    Cy_Crypto_Core_V2_RBSwap(base);
    Cy_Crypto_Core_V2_RBStore(base, 0U, hashState->digestSize);

    Cy_Crypto_Core_V2_FFStoreSync(base);

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Update
****************************************************************************//**
*
* Performs the SHA calculation on one message.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param message
* The pointer to the message whose Hash is being computed.
*
* \param messageSize
* The size of the message whose Hash is being computed.
*
* \return
* \ref cy_en_crypto_status_t
*
* \note
* This function can be called several times only with message lengths dividable
* by the block size. Only the last call to the function can process a message with
* a not-dividable size.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Update(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t const *message,
                               uint32_t messageSize)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *messageRemap;

    if(messageSize == 0UL)
    {
        return CY_CRYPTO_SUCCESS;
    }

    if ((hashState != NULL) && (message != NULL))
    {

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)message,(int32_t)messageSize);
#endif

        messageRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(message);

        if (hashState->blockSize != 0U)
        {

            switch ((cy_en_crypto_sha_mode_t)hashState->mode)
            {

            #if (CPUSS_CRYPTO_SHA1 ==1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED)
            case CY_CRYPTO_MODE_SHA1:
                tmpResult = Cy_Crypto_Sha1_Sha2_Update(base, hashState, messageRemap, messageSize);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA256 ==1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
            case CY_CRYPTO_MODE_SHA224:
            case CY_CRYPTO_MODE_SHA256:
                tmpResult = Cy_Crypto_Sha1_Sha2_Update(base, hashState, messageRemap, messageSize);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA512 ==1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
            case CY_CRYPTO_MODE_SHA384:
            case CY_CRYPTO_MODE_SHA512:
            case CY_CRYPTO_MODE_SHA512_224:
            case CY_CRYPTO_MODE_SHA512_256:
                tmpResult = Cy_Crypto_Sha1_Sha2_Update(base, hashState, messageRemap, messageSize);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
            case CY_CRYPTO_MODE_SHA3_224:
            case CY_CRYPTO_MODE_SHA3_256:
            case CY_CRYPTO_MODE_SHA3_384:
            case CY_CRYPTO_MODE_SHA3_512:
                tmpResult = Cy_Crypto_Sha3_Update(base, hashState, messageRemap, messageSize);
                break;
                #endif

            default:
                    tmpResult = CY_CRYPTO_BAD_PARAMS;
                break;
            }
            
