zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_sha_v2.c
        }
    }

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Finish
****************************************************************************//**
*
* Completes SHA calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \param digest
* The pointer to the calculated hash digest.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Finish(CRYPTO_Type *base,
                               cy_stc_crypto_sha_state_t *hashState,
                               uint8_t *digest)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *digestRemap;

    if ((hashState != NULL) && (digest != NULL))
    {
        digestRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(digest);

        switch ((cy_en_crypto_sha_mode_t)hashState->mode)
        {

            #if (CPUSS_CRYPTO_SHA1 ==1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED)
            case CY_CRYPTO_MODE_SHA1:
                tmpResult = Cy_Crypto_Sha1_Sha2_Finish(base, hashState, digestRemap);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA256 ==1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
            case CY_CRYPTO_MODE_SHA224:
            case CY_CRYPTO_MODE_SHA256:
                tmpResult = Cy_Crypto_Sha1_Sha2_Finish(base, hashState, digestRemap);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA512 ==1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
            case CY_CRYPTO_MODE_SHA384:
            case CY_CRYPTO_MODE_SHA512:
            case CY_CRYPTO_MODE_SHA512_224:
            case CY_CRYPTO_MODE_SHA512_256:
                tmpResult = Cy_Crypto_Sha1_Sha2_Finish(base, hashState, digestRemap);
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
            case CY_CRYPTO_MODE_SHA3_224:
            case CY_CRYPTO_MODE_SHA3_256:
            case CY_CRYPTO_MODE_SHA3_384:
            case CY_CRYPTO_MODE_SHA3_512:
                tmpResult = Cy_Crypto_Sha3_Finish(base, hashState, digestRemap);
                break;
            #endif

            default:
                    tmpResult = CY_CRYPTO_BAD_PARAMS;
                    break;

        }
    }

    #if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    if(tmpResult == CY_CRYPTO_SUCCESS)
    {
        SCB_InvalidateDCache_by_Addr(digest, (int32_t)hashState->digestSize);
    }
    #endif

    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Sha_Free
****************************************************************************//**
*
* Clears the used memory buffers.
*
* For CAT1C & CAT1D(CM55) devices when D-Cache is enabled parameter hashState must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param hashState
* The pointer to the SHA context.
*
* \return
* \ref cy_en_crypto_status_t
*
* *******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Sha_Free(CRYPTO_Type *base, cy_stc_crypto_sha_state_t *hashState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *hashRemap;
    uint8_t *blockRemap;
    cy_stc_crypto_sha_state_t *stateRemap;

    if ((NULL != base) && (hashState != NULL))
    {
        hashRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->hash);
        blockRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState->block);
        stateRemap = (cy_stc_crypto_sha_state_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(hashState);

        
        /* Clears the context buffers */
        tmpResult = CY_CRYPTO_SUCCESS;

        switch ((cy_en_crypto_sha_mode_t)hashState->mode)
        {

            #if (CPUSS_CRYPTO_SHA1 ==1) && defined(CY_CRYPTO_CFG_SHA1_ENABLED)
            case CY_CRYPTO_MODE_SHA1:
                if(NULL != blockRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, blockRemap, 0x00U, (uint16_t)hashState->blockSize);
                }
                if(NULL != hashRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, hashRemap,  0x00U, (uint16_t)hashState->hashSize);
                }
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA256 ==1) && defined(CY_CRYPTO_CFG_SHA2_256_ENABLED)
            case CY_CRYPTO_MODE_SHA224:
            case CY_CRYPTO_MODE_SHA256:
                if(NULL != blockRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, blockRemap, 0x00U, (uint16_t)hashState->blockSize);
                }
                if(NULL != hashRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, hashRemap,  0x00U, (uint16_t)hashState->hashSize);
                }
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA512 ==1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
            case CY_CRYPTO_MODE_SHA384:
            case CY_CRYPTO_MODE_SHA512:
            case CY_CRYPTO_MODE_SHA512_224:
            case CY_CRYPTO_MODE_SHA512_256:
                if(NULL != blockRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, blockRemap, 0x00U, (uint16_t)hashState->blockSize);
                }
                if(NULL != hashRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, hashRemap,  0x00U, (uint16_t)hashState->hashSize);
                }
                break;
            #endif

            #if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
            case CY_CRYPTO_MODE_SHA3_224:
            case CY_CRYPTO_MODE_SHA3_256:
            case CY_CRYPTO_MODE_SHA3_384:
            case CY_CRYPTO_MODE_SHA3_512:
                if(NULL != hashRemap)
                {
                    Cy_Crypto_Core_V2_MemSet(base, hashRemap,  0x00U, (uint16_t)hashState->hashSize);
                }                break;
            #endif

            default:
                tmpResult = CY_CRYPTO_NOT_SUPPORTED;
                break;

